Repository: FRACerqueira/PromptPlus
Catalog: src/Resources/PromptPlusResources.*.resx
Languages: pt_br

# AnyKey
source: or press any other key to end
pt_br: ou pressione qualquer outra tecla para terminar

# CanceledKey
source: Canceled
pt_br: Cancelado

source: Filter
pt_br: Filtro

source: Group
pt_br: Grupo

# HistoryNotFound
source: Empty history for input data
pt_br: Historico vazio para os dados informados

# InputFinishEnter
source: Enter:Finish
pt_br: Enter:Concluir

# MaskEditPosAnyChar
source: Any char (A-Z,a-z,0-9)
pt_br: Qualquer texto ( (A-Z,a-z,0-9))

# MaskEditPosCustom
source: {0}{1}Only({2})
pt_br: {0}{1}Somente({2})

# MaskEditPosDay
source: Day (0-9)
pt_br: Dia (0-9)

# MaskEditPosHour
source: Hour (0-9)
pt_br: Hora (0-9)

# MaskEditPosLetter
source: Letter (A-Z,a-z)
pt_br: Letra (A-Z,a-z)

# MaskEditPosMinute
source: Minute (0-9)
pt_br: Minuto (0-9)

# MaskEditPosMonth
source: Month (0-9)
pt_br: Mês (0-9)

# MaskEditPosNumeric
source: Numeric (0-9)
pt_br: Número (0-9)

# MaskEditPosSecond
source: Second (0-9)
pt_br: Segundo (0-9)

# MaskEditPosYear
source: Year (0-9)
pt_br: Ano (0-9)

# MoveDays
source: Left/Right:Change day
pt_br: Left/Right:Mudar dia

# MoveDayWeek
source: Up/Down:Change day with same day of week
pt_br: Up/Down:Mudar dia com o mesmo dia da semana

# MoveMonth
source: Tab/Shift Tab:Change Month
pt_br: Tab/Shift Tab:Mudar Mes

# MoveToday
source: Home:Today
pt_br: Home:Hoje

# MoveYear
source: PgUp/PgDown:Change year
pt_br: PgUp/PgDown:Mudar ano

# MultiSelectCheck
source: Space:Check/Uncheck
pt_br: Space:Marcar/Desmarcar

# MultiSelectMaxSelection
source: Maximum item selection({0}) has been exceeded
pt_br: Máximo de {0} itens já foi ultrapassado

# MultiSelectMinSelection
source: Minimum selection of {0} items is required
pt_br: Mínimo de {0} itens é necessário

# OffValue
source: Off
pt_br: Desligado

# OnValue
source: On
pt_br: Ligado

# OrderHighest
source: Highest value
pt_br: Maior valor

# OrderLabelAsc
source: Label ascending
pt_br: Rótulo ascendente

# OrderLabelDec
source: Label descending
pt_br: Rótulo descendente

# OrderSmallest
source: Smallest value
pt_br: Menor valor

# OrderStandard
source: Standard
pt_br: Padrão

# PaginationTemplate
source: Displaying: {1}/{2} pages of {0} items.
pt_br: Exibindo: {1}/{2} páginas de {0} itens.

source: Pressed key
pt_br: Tecla pressionada

# SelectionDisabled
source: Item disabled
pt_br: Item desativado

# SliderNumberLeftRightKeyNavigator
source: Left/Right:Short change, Tab/Shift+Tab:Larger change
pt_br: Left/Right:Valor curto, Tab/Shift+Tab:Valor grande

# SliderNumberUpDownKeyNavigator
source: Up/Down:Short change, Tab/Shift+Tab:Larger change
pt_br: Up/Down:Valor curto, Tab/Shift+Tab:Valor grande

# SwitchKeyNavigator
source: Left/Right:Change
pt_br: Left/Right:Mudar

# TableMoveCols
source: {0}, Ctrl+Left/Right:Move column
pt_br: {0}, Ctrl+Left/Right:Move colunas

# TooltipCancelEsc
source: {0}:To cancel
pt_br: {0}:Cancelar

# TooltipChart
source: Up/Down/PgUp/PgDown:Move, Enter:Finish
pt_br: Up/Down/PgUp/PgDown:Mover, Enter:Concluir

# TooltipChartSwitchLegend
source: {0}:Switch view legend
pt_br: {0}:Ver/Esconder legenda

# TooltipChartSwitchOrder
source: {0}:Switch order view
pt_br: {0}:Mudar ordenação

# TooltipChartSwitchType
source: {0}:Toggle Chart type
pt_br: {0}:Mudar tipo de chart

# TooltipShowHide
source: {0}:Show/Hide tooltips
pt_br: {0}:Ver/Esconder dicas

# TooltipHistoryClear
source: Ctrl+Del:Clear historic
pt_br: Ctrl+Del:Limpar histórico

# TooltipHistoryEsc
source: Esc:Cancel historic
pt_br: Esc:Cancelar histórico

# TooltipHistoryShow
source: {0}:Show Historic(Min. {1} chars)
pt_br: {0}:Mostrar histórico(mín.{1} caracteres)

# TooltipOrder
source: Ordination: {0}
pt_br: Ordenação:{0}

# TooltipPages
source: Up/Down/PgUp/PgDown:Move Selector, Ctrl+Home/End: First/Last item
pt_br: Up/Down/PgUp/PgDown:Mover

# TooltipSelectAll
source: {0}:Toggle Mark All
pt_br: {0}:Alternar Marcar todos

# TooltipSuggestionEsc
source: Esc:Cancel suggestion
pt_br: Esc:Cancelar sugestões

# TooltipSuggestionToggle
source: Tab/Shift Tab:Suggestions
pt_br: Tab/Shift Tab:Sugestões

# TooltipToggle
source: {0}:Toggle tooltips
pt_br: {0}:Alternar dicas

# TooltipToggleExpandPress
source: +/-:Expand/Collapse
pt_br: +/-:Expandir/Recolher

# TooltipToggleNotes
source: {0}:Toggle Notes
pt_br: {0}:Ver/Esconder Notas

# TooltipViewPassword
source: {0}:Switch view password
pt_br: {0}:Ver/Esconder senha

# ValidAnyKey
source: Valid key: {0}
pt_br: Tecla válida : {0}

# ValidateInvalid
source: Invalid value!
pt_br: Valor inválido!

# ValidateMaxLength
source: Value is too long. Max({0})
pt_br: Valor é grande. Max({0})

# ValidateMinLength
source: Value is too short. Min({0})
pt_br: Valor é pequeno. Min({0})

# ValidateNoMatchRegex
source: Value is not match pattern
pt_br: O valor não corresponde ao padrão

# ValidateRequired
source: Required Value!
pt_br: Valor é necessário

# YesChar
source: Y
pt_br: S

# Emac_ctrl_t
source: Ctrl+T:Transpose the previous two characters
pt_br: Ctrl+T:Transpõe os dois caracteres anteriores

# Emac_ctrl_l
source: Ctrl+L:Clears all content
pt_br: Ctrl+L:Limpa todo o conteúdo

# Emac_alt_l
source: Alt+L:Lowercase from cursor to end of word
pt_br: Alt+L:Minusculo do cursor até o final da palavra

# Emac_ctrl_u
source: Ctrl+U:Clears the line before cursor
pt_br: Ctrl+U:Limpa a linha antes do cursor

# Emac_alt_u
source: Alt+U:Upper case from the cursor to the end the word.
pt_br: Alt+U:Maiúsculas do cursor até o final da palavra.

# Emac_ctrl_k
source: Ctrl+K:Clears the line after cursor
pt_br: Ctrl+K:Limpa a linha após o cursor

# Emac_ctrl_w
source: Ctrl+W:Clear the word before cursor
pt_br: Ctrl+W:Limpa a palavra antes do cursor

# Emac_alt_c
source: Alt+C:Capitalizes character under the cursor and moves to the end the word
pt_br: Alt+C:Coloca em maiúscula o caractere sob o cursor e move para a final da palavra

# Emac_alt_d
source: Alt+D:Clear word after cursor
pt_br: Alt+D:Limpar palavra após o cursor

# Emac_alt_f
source: Alt+F:Moves cursor forward one word
pt_br: Alt+F:Move o cursor uma palavra para frente

# Emac_alt_b
source: Alt+B:Moves cursor backward one word
pt_br: Alt+B:Move o cursor uma palavra para trás

# Emac_ctrl_h
source: Ctrl+H:Deletes the previous character (equivalent to the backspace key)
pt_br: Ctrl+H:Limpa a linha após o cursor

# Emac_ctrl_e
source: Ctrl+E:Moves cursor to the line end (equivalent to the end key)
pt_br: Ctrl+E:Move o cursor para o final da linha (equivalente à tecla End)

# Emac_ctrl_a
source: Ctrl+A:Moves the cursor to the line start (equivalent to the home key)
pt_br: Ctrl+A:Move o cursor para o início da linha (equivalente à tecla home)

# Emac_ctrl_b
source: Ctrl+B:Moves the cursor back one character (equivalent to the left arrow key)
pt_br: Ctrl+B:Move o cursor um caractere para trás (equivalente à tecla de seta para a esquerda)

# Emac_ctrl_f
source: Ctrl+F:Moves the cursor forward one character (equivalent to the right arrow key)
pt_br: Ctrl+F:Move o cursor um caractere para frente (equivalente à tecla de seta para a direita)

# Emac_ctrl_d
source: Ctrl+D:Delete the current character (equivalent to the delete key)
pt_br: Ctrl+D:Apaga o caractere atual (equivalente à tecla delete)

# Emac_Insert
source: Insert:Toggle input replacement mode (default is insert mode)
pt_br: Insert:Alterna modo de substituição (padrão é o modo de inserção)

# ShowingCalendarNotes
source: Showing notes of the day {0}
pt_br: Mostrando notas do dia {0}

# NoteNotFound
source: Empty notes for input data
pt_br: Notas vazias para os dados informados

# InvalidKey
source: Invalid Key: {0}
pt_br: Tecla Inválida: {0}

# YesText
source: Yes
pt_br: Sim

# NoText
source: No
pt_br: Não

# TooltipWaitTimer
source: Timer:
pt_br: Temporizador:

# TaksRunning
source: Executing {0} task(s)
pt_br: Executando {0] tarefa(s)

# TaskSeqName
source: Task{0}
pt_br: Tarefa{0}

# TaskFiniched
source: {0} completed, {1} Error, {2} canceled
pt_br: {0} concluído(s), {1} erro(s), {2} cancelado

source: Error!
pt_br: Erro!

source: Entry history
pt_br: Histórico de entrada

# TooltipHistoryKey
source: {0}:Show Historic
pt_br: {0}:Mostrar histórico

# TooltipFilterMode
source: {0}:Toggle filter mode
pt_br: {0}:Alternar modo filtro

# TooltipCountCheck
source: {0} seleted.
pt_br: {0} selecionados

# ErrorAutoCompleteService
source: Error at AutoComplete Service
pt_br: Erro no serviço de preenchimento automático

# EntryOptions
source: Choice options
pt_br: Opções de escolha

# MaskEditPosConstant
source: Constant ({0})
pt_br: Constante ({0})

# MaskEditPosLetterUpper
source: Letter (A-Z)
pt_br: Letra (A-Z)

# MaskEditPosSpace
source: Space
pt_br: Espaço

# MaskEditPosDateSep
source: Date separator
pt_br: Separador de data

# MaskEditPosTimeSep
source: Time seprator
pt_br: Separador de tempo

# MaskEditPosDecSep
source: Decimal separator
pt_br: Separador de decimal

# MaskEditPosGrpSep
source: Group separator
pt_br: Separador de grupo

# MaskEditPosCurrencySymbol
source: Currency Symbol
pt_br: Símbolo da moeda

# MaskEditPosSing
source: Signal +-
pt_br: Sinal +-

# MaskeditInputPending
source: There are unreported entries.
pt_br: Existem entradas não digitadas.

# MaskEditInvalidInput
source: Entries with invalid values
pt_br: Entradas com valores inválidos

# TableAnswerRow
source: Row: {0}
pt_br: Linha: {0}

# TableAnswerMultiRow
source: Rows: {0}
pt_br: Linhas: {0}

# PredicateSelectInvalid
source: Selected item does not meet the criteria
pt_br: Item selecionado não atende aos critérios

# FileInfoRoot
source: Root folder
pt_br: Pasta Raiz

# FileInfoFolder
source: Folder : {0}
pt_br: Pasta : {0}

source: Loading...
pt_br: Carregando...

source: Unloading...
pt_br: Descarregando...

# TooltipLevelHomeEnd
source: Ctrl+Home:Previus level, Ctrl+End : Last Item of level
pt_br: Home: Nível anterior, End: Último item do nível

source: Search Filter :
pt_br: Filtro de pesquisa :

source: Filtered
pt_br: Filtrado

# InputFinishFilter
source: Enter:Apply filter
pt_br: Enter:Aplicar filtro

# SpaceMultSelect
source: Shift+Space = Space for filter
pt_br: Shift+Espaço = Espaço para filtro

# NotCollapse
source: There are marked items, cannot be collapsed
pt_br: Há itens marcados, não podem ser recolhido

# NodePath
source: Path :
pt_br: Caminho :

# TooltipExpandAllPress
source: Alt+:Expand All
pt_br: Alt+:Expandir todos
