Repository: FRACerqueira/PromptPlus
Catalog: PromptPlus/Resources/PromptPlusResources.*.resx
Languages: pt_br

# AnyKey
source: Press any key
pt_br: Digite qualquer tecla

# CanceledText
source: Canceled
pt_br: Cancelado

source: Empty Title
pt_br: Título vazio

# EnterFininsh
source: Enter: Finish
pt_br: Enter: Terminar

# EscCancel
source: , {0}: To cancel
pt_br: , {0}: Cancelar

# EscCancelWithPipeline
source: , {0}: Cancel pipe, {1}: Cancel all pipes
pt_br: , {0}: Cancelar pipe, {1} : Cancelar pipes

# EscCancelWithPipeNotAll
source: , {0}: Cancel pipe
pt_br: , {0}: Cancelar pipe

# FileNotSelected
source: item not a file!
pt_br: item não é um arquivo!

# FolderCurrentPath
source: Folder:
pt_br: Pasta:

# FolderKeyNavigation
source: Ctrl+Left/Right: Dry folder, Enter: Select, {0}: Filter
pt_br: Ctrl+Left/Right: Entar na pasta, Enter: Selecionar, {0}: Filtro

# Invalid
source: Value is invalid
pt_br: Valor é inválido

source: Items Filtered!
pt_br: Itens filtrados!

# KeyNavPaging
source: PgUp/PgDown: Page,
pt_br: PgUp/PgDown: Paginar,

# ListItemAlreadyexists
source: Item already exists
pt_br: Item já existe

# ListKeyNavigation
source: Ctrl+Del: Remove seleted , {0}: Remove all, Enter: Finish
pt_br: Ctrl+Del: Remove selecionado, {0}: Remove tudo, Enter: Terminar

# ListMaxSelection
source: A maximum input of {0} items has already been reached
pt_br: O máximo de itens ({0}) foi atingido

# ListMinSelection
source: A minimum input of {0} items is required
pt_br: O minimo de itens({0}) é necessário

# LongNoKey
source: No
pt_br: Não

# LongYesKey
source: Yes
pt_br: Sim

# MaxLength
source: Value is too long. Max({0})
pt_br: Valor é muito grande. Max({0})

# MinLength
source: Value is too short. Min({0})
pt_br: Valor é muito pequeno. Min({0})

# MultiSelectKeyNavigation
source: {0} Select/Unselect, Enter: Finish, {1}: Filter, {2}: All, {3}:Invert
pt_br: {0}: Marcar, Enter: Terminar, {1}: Filtro {2}: Todos, {3}:Inverter

# MultiSelectMaxSelection
source: A maximum selection of {0} items has already been reached
pt_br: O máximo de seleção({0}) foi atingido

# MultiSelectMinSelection
source: A minimum selection of {0} items is required
pt_br: O minimo de seleção({0}) é necessário

# NoMatchRegex
source: Value is not match pattern
pt_br: Valor digitado não segue o padrão

# OffValue
source: Off
pt_br: Desligado

# OnValue
source: On
pt_br: Ligado

# PaginationTemplate
source: {0} items, {1}/{2} pages
pt_br: {0} itens, {1}/{2} paginas

# PipeLineText
source: Pipes summary
pt_br: Resumo dos passos

source: Pressed key
pt_br: Tecla Pressionada

# Required
source: Value is required
pt_br: Valor é obrigatório

# ResizedTerminal
source: Terminal has resized!
pt_br: Terminal redimensionado!

# ResizeTerminal
source: Resize : {0} to {1} rows...Press any key.
pt_br: Redimensione: {0} to {1} linhas...Digite qualquer tecla.

# RunningText
source: Running
pt_br: Executando

# SelectKeyNavigation
source: Enter: Select, {0}: Filter
pt_br: Enter: Selecionar, {0}: Filtro

# ShowKeyPressStandardHotKeysWithPipeline
source: {0}, {1} Swith pipes summary{2}
pt_br: {0}, {1} Mostrar resumo dos passos{2}

# ShowProcessStandardHotKeysWithPipeline
source: {0}, Toggle pipes summary{1}
pt_br: {0} Mostrar resumo pipes{1}

# ShowStandardHotKeys
source: {0} Toggle tooltips{1}
pt_br: {0} Alternar dicas{1}

# ShowStandardHotKeysWithPipeline
source: {0} Toggle tooltips, {1} Toggle pipes summary{2}
pt_br: {0} Alternar dicas, {1} Alternar resumo dos pipes{2}

# SkipedText
source: Skiped
pt_br: Ignorado

# SliderNumberKeyNavigator
source: Left/Right: Short change, Crtl+Left/Right: Larger change, Enter: Finish
pt_br: Left/Right: Passo curto, Crtl+Left/Right: Passo grande , Enter: Terminar

# SliderSwitcheKeyNavigator
source: , Left/Right: Change, Enter: Finish
pt_br: , Left/Right: Mudar , Enter: Terminar

# SummaryPipelineReturnto
source: return to
pt_br: voltar para

# WaittingProcess
source: Waiting {0} of {1}
pt_br: Aguardando {0} de {1}

# WaittingText
source: Waiting
pt_br: Aguardando

# YesKey
source: Y
pt_br: S

# PasswordStandardHotkeys
source: {0}, {1}:Toggle password
pt_br: {0}, {1}:Mostrar/Esconder senha

# MaskEditPosYear
source: Year
pt_br: Ano

# MaskEditPosSecond
source: Second
pt_br: Segundo

# MaskEditPosNumeric
source: Numeric
pt_br: Numerico

# MaskEditPosMonth
source: Month
pt_br: Mês

# MaskEditPosMinute
source: Minute
pt_br: Minuto

# MaskEditPosLetter
source: Letter
pt_br: Letra

# MaskEditPosHour
source: Hour
pt_br: Hora

# MaskEditPosDay
source: Day
pt_br: Dia

# MaskEditPosCustom
source: Only({0})
pt_br: Somente({0})

# MaskEditPosAnyChar
source: Any char
pt_br: Qualquer caracter

# MaskEditErase
source: ,Ctrl+Del: Erase all
pt_br: ,Ctrl+Del: apagar tudo

# MaskEditInputType
source: Input type: {0}
pt_br: Tipo Entrada: {0}

# InvalidTypeByte
source: Invalid value for number (-128 to 127)
pt_br: Valor inválido para número (-128 a 127)

# InvalidTypeNumber
source: Invalid value for number
pt_br: Valor inválido para número

# InvalidTypeDateTime
source: Invalid value for Date({0})/Time({1})
pt_br: Valor inválido para Data({0})/Hora({1})

# InvalidTypeChar
source: Invalid value for single character
pt_br: Valor inválido para um único caracater

# InvalidTypeBoolean
source: Invalid value for number boolean(0:False/1:True)
pt_br: Valor inválido para lógico(0:Falso/1:Verdadeiro)

# FinishResultList
source: Finish with {0} items
pt_br: Terminado com {0} itens

# FinishResultTasks
source: Finish all tasks({0})
pt_br: Terminado todas as tarefas({0})

# AutoCompleteKeyNavigation
source: Enter: Select, {0}: Unselect, Ctrl-Enter: Update text input
pt_br: Enter: Selecionar, {0}: Sem seleção, Ctrl-Enter: Atualiza o Texto

# AutoCompleteKeyNotfound
source: {0} not found in sugestions
pt_br: {0} não encontrado nas sugestões

# ShowStandardHotKeysDesc
source: {0} Toggle tooltips, {1} Toggle description{2}
pt_br: {0} Alternar dicas, {1} Alternar descrição{2}

# HotKeyDescription
source: {0} Show/Hide description
pt_br: {0} Alternar descrição

# EscCancelWizard
source: , {0}: To Wizard
pt_br: , {0}: Voltar para Wizard

# ListKeyNavigationFillZeros
source: Ctrl+Del: Remove seleted , {0}: Remove all, Ctrl+Enter: Finish, Enter: Add
pt_br: Ctrl+Del: Remove selecionado, {0}: Remove tudo, Ctrl+Enter: Terminar, Enter : Incluir

# EnterAcceptSugestion
source: Enter: Accept suggestion
pt_br: Enter: Aceitar sugestão

# ReadlineFisnishHistoryhit
source: Enter: Select&Fisnish
pt_br: Enter: Selecionar&Terminar

# ReadlineHistoryEsc
source: Esc: Cancel historic
pt_br: Esc: Cancela histórico

# ReadlineHistoryhit
source: Down/PgDown: Historic(Min. {0} chars), Ctrl+Del:Clear historic
pt_br: Down/PgDown: Histórico(Min. {0} chars)

# ReadlineNotFisnishHistoryhit
source: Enter: Select&Close
pt_br: Enter: Seleciona&Fechar

# ReadlineSugestionhit
source: Tab/Shift: Sugestions
pt_br: Tab/Shift: Sugestões

# ReadlineSugestionMode
source: Esc: Cancel sugestion
pt_br: Esc: Cancelar sugestão e retornar

# NumberUpDownKeyNavigator
source: Up/Down: Short change, Crtl+Left/Right: Larger change, Enter: Finish
pt_br: Up/Down: valor curto, Crtl+Left/Right: valor grande, Enter: Terminar
